Repository: Judiviga/RobotCompetitionController
Catalog: lib/l10n/app_*.arb
Languages: es

source: Settings
es: Configuraci贸n

# disabled
source: Bluetooth Disabled
es: Bluetooth Desactivado

source: Disconnected
es: Desconectado

source: Connected
es: Conectado

# profile
source: Select robot
es: Seleccionar robot

source: Name
es: Apodo

# nameEdit
source: Edit profile name
es: Editar nombre

source: Device
es: Dispositivo

# deviceNew
source: New Device
es: Seleccionar

# reverseL
source: Reverse Left
es: Invertir Izquierda

# reverseR
source: Reverse Right
es: Invertir Derecha

# speedMin
source: Min Speed [PWM]
es: Starting Speed [PWM]

# speedMinMessage
source: Lowest speed to start movement
es: Minima velocidad para iniciar el movimiento

# speedMax
source: Speed
es: Velocidad

# speedFast
source: Fast
es: Rapido

# speedMaxMessage
source: Limits the maximum speed (PWM) of the robot Slow 100 Normal 150 Fast 200 Turbo 255
es: Limita la maxima velocidad del robot (PWM) Lento 100 Normal 150 Rapido 200 Turbo 255

# accel
source: Acceleration Factor
es: Aceleraci贸n

# accelMessage
source: Limiting the aceleration helps the robot run straighter and softer
es: Limitar la aceleraci贸n produce un movimiento mas suave y recto

# rotation
source: Rotating Speed Factor
es: Velocidad de Rotaci贸n

# rotationMessage
source: This factor determines how fast the robot turn
es: Este valor determina la velocidad a la que rota el robot

# correction
source: Correction Factor
es: Factor de Balanceo

# correctionMessage
source: Use this factor to straighten the robot. Increase the value if the robot tilts to the left and lower it if it tilts to the right
es: Use este factor para alinear el movimiento del robot. Aumente el valor si el robot se desvia hacia la izquirda, y disminuyalo si se desvia a la derecha

# reset
source: Reset Parameters
es: Restaurar Parametros

# delete
source: Delete Robot
es: Eliminar Robot

# resetMessage
source: Restore default values
es: Restaurar a los valores predeterminados

# deleteMessage
source: Delete the current robot
es: Eliminar el robot actual

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

source: Discovered devices
es: Dispositivos Encontrados

source: Discovering devices
es: Buscar Dispositivos
